app/views/events/index.html.erb

    <% @events.each do |event| %>
    <% u = User.find(event[:user_id]) %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]