app/views/events/show.html.erb

<% id = params[:id] %>
<% e = Event.find(id) %>
<% u = User.find(e[:user_id]) %>
---
SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]