app/views/photos/index.html.erb

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
    <% @photos.each do |photo| %>
    <% e = Event.find(photo[:event_id]) %>
    <% u = User.find(e[:user_id]) %>