app/controllers/events_controller.rb

SELECT "photos".* FROM "photos"  WHERE "photos"."ownerEvent" = 3  ORDER BY createdDate
SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    id = params[:id]
    @photos = Photo.where(:ownerEvent => id)
    @event = Event.find(id)
    @user = User.find(@event.ownerUser)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "events".* FROM "events"  WHERE "events"."ownerUser" = 2
---
  def user
    @id = params[:id]
    @user = User.find(@id)
    @events = Event.where(:ownerUser => @id)