app/controllers/events_controller.rb

SELECT "photos".* FROM "photos"  WHERE "photos"."event_id" = 2  ORDER BY "photos"."id" ASC
---
  def show
    id = params[:id]
    @photos = Photo.where(:event_id => id)