app/controllers/photos_controller.rb

  def show
    @id = params[:id]
    @p = Photo.find(@id)
    @e = Event.find(@p.event_id)
    @u = User.find(@e.user_id)
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    userid = 1
    u = User.find(userid)
    uname = u.firstName
    closest_event = -1
    distance_event = 0
    plat = BigDecimal(photo_params[:latitude])
    plon = BigDecimal(photo_params[:longitude])
    Event.where(:user_id => userid).each do |event|
      d = distance(plat, plon, event.latitude, event.longitude)
      if (closest_event == -1) or (d < distance_event) then
        closest_event = event.id
        distance_event = d
      end
    end
    if (closest_event != -1) and (distance_event <= 500) then
      event = Event.find(closest_event)
    else
      event = Event.create(user_id: userid, createdDate: DateTime.now,
                           title: uname + "'s event", description: uname + "'s event...",
                           latitude: photo_params[:latitude],
                           longitude: photo_params[:longitude])
    end
    @photo = Photo.new(photo_params)
    @photo.event_id = event.id
    if photo_params[:thumbnail] == nil then @photo[:thumbnail] = photo_params[:url] end
    savestatus = @photo.save

    respond_to do |format|
      if savestatus
        event.title = uname + "'s event #" + Event.where(:user_id => event.user_id).count.to_s
        if event.thumbnail == nil then event.thumbnail = @photo.thumbnail end
        event.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "events".* FROM "events"  WHERE "events"."user_id" = 1
SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "events" ("createdDate", "created_at", "description", "latitude", "longitude", "thumbnail", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "photos" ("bitmap", "createdDate", "created_at", "description", "latitude", "longitude", "ownerEvent", "thumbnail", "title", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT COUNT(*) FROM "events"  WHERE "events"."user_id" = 3
UPDATE "events" SET "thumbnail" = $1, "title" = $2, "updated_at" = $3 WHERE "events"."id" = 10  [["thumbnail", ""], ["title", "My event #6"], ["updated_at", "2014-12-28 02:07:38.753251"]]