app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "firstName", "lastName", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-11 16:14:34.655469"], ["email", "e"], ["firstName", "q"], ["lastName", "w"], ["updated_at", "2014-11-11 16:14:34.655469"]]
---
  def create
    @user = User.new(user_params)
    if @user.save